/*=======================================================
* 文件说明
* 描    述:公共基本类型定义
* 文件名称:publicbasic.h
*========================================================*/


/*=======================================================
* 标准头文件、头文件
*========================================================*/
#include <linux/init.h>
#include <linux/module.h>
#include <linux/kernel.h>

/*=======================================================
* 宏定义
*========================================================*/

/*=======================================================
* 结构体，数据类型定义
*========================================================*/
typedef unsigned char BYTE;
typedef unsigned short WORD16;
typedef unsigned int WORD32;
typedef unsigned long long WORD64;
typedef signed char CHAR;
typedef signed short SWORD16;
typedef signed int SWORD32;
typedef signed long long SWORD64;
typedef void VOID;

#ifndef NULL
#define NULL (0)
#endif


#ifndef TRUE
#define TRUE (1)
#endif

#ifndef FALSE
#define FALSE (0)
#endif




/*=======================================================
* 全局变量，局部变量定义
*========================================================*/


/*=======================================================
* 函数声明
*========================================================*/


/*=======================================================
* 函数、类实现
*========================================================*/




















